# Pandas

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html

In [1]:
# Modules to import
import pandas as pd
import openpyxl

In [2]:
# Intialise data of lists.
data = {'Name':['Edward','Abby', 'Chris', 'Dean','Bert'],
        'Age':[12, 21, 19, 52,34]}
 
# Create DataFrame
df = pd.DataFrame(data)
df

     Name  Age
0  Edward   12
1    Abby   21
2   Chris   19
3    Dean   52
4    Bert   34

In [3]:
# Adding a column
df['Country'] = 'United States'
df

     Name  Age        Country
0  Edward   12  United States
1    Abby   21  United States
2   Chris   19  United States
3    Dean   52  United States
4    Bert   34  United States

In [4]:
# Making a change based on an event
df.loc[(df.Name == 'Chris'),'Country']='Mexico'
df

     Name  Age        Country
0  Edward   12  United States
1    Abby   21  United States
2   Chris   19         Mexico
3    Dean   52  United States
4    Bert   34  United States

In [5]:
# Resorting based on a column
df = df.sort_values(by=['Name'])
df

     Name  Age        Country
1    Abby   21  United States
4    Bert   34  United States
2   Chris   19         Mexico
3    Dean   52  United States
0  Edward   12  United States

In [6]:
# Adding a new row
new_row = {'Name':'Frank','Age':'46','Country':'Denmark'}  # The dictionary set with the new data
# df = df.append(new_row, ignore_index=True)  # old line that is error prone
df.loc[len(df)] = new_row  # specifying that we want to add the new row to the bottom of the existing dataframe
df

     Name Age        Country
1    Abby  21  United States
4    Bert  34  United States
2   Chris  19         Mexico
3    Dean  52  United States
0  Edward  12  United States
5   Frank  46        Denmark

In [7]:
# Renaming a column
df.rename(columns={'Country': 'Location'}, inplace=True)
df

     Name Age       Location
1    Abby  21  United States
4    Bert  34  United States
2   Chris  19         Mexico
3    Dean  52  United States
0  Edward  12  United States
5   Frank  46        Denmark

In [8]:
# Adding a column and assigning based on another column
df['Life_Stage'] = ['Old' if x > 25 else 'Young' for x in df['Age']]  # Designed to error out
df

TypeError: '>' not supported between instances of 'str' and 'int'

In [9]:
# This errored out because the data is currently assigned as a string, and we're asking to do math with strings


# Let's look at data types
df.dtypes

Name        object
Age         object
Location    object
dtype: object

<center><a href="https://pbpython.com/images/pandas_dtypes.png">Data Types</a></center>
<img src="https://pbpython.com/images/pandas_dtypes.png">

In [10]:
# Here's a quick example of each of the pandas data types
import datetime
from pandas.api.types import CategoricalDtype
# Going through data types
things = [{'Name':'Maggie','Position':1,'Time':2.3,'Shoes':True,'Join': datetime.datetime(2020, 1, 1),'Race_Time':pd.Timedelta("1 days"),'T_Shirt':"Small",},
         {'Name':'Peter','Position':10,'Time':17.2,'Shoes':False,'Join':datetime.datetime(2021, 6, 23),'Race_Time':pd.Timedelta("12 hours"),'T_Shirt':"Medium"},
         {'Name':'Janey','Position':6,'Time':12.5,'Shoes':True,'Join':datetime.datetime(2021, 4, 11),'Race_Time':pd.Timedelta("16 hours 13 minutes"),'T_Shirt':"Large"}]
things_df = pd.DataFrame(things)
t_shirt_size = CategoricalDtype(categories=['Small', 'Medium','Large','Extra Large'], ordered=True)
things_df['T_Shirt'] = things_df['T_Shirt'].astype(t_shirt_size)
things_df

     Name  Position  Time  Shoes       Join       Race_Time T_Shirt
0  Maggie         1   2.3   True 2020-01-01 1 days 00:00:00   Small
1   Peter        10  17.2  False 2021-06-23 0 days 12:00:00  Medium
2   Janey         6  12.5   True 2021-04-11 0 days 16:13:00   Large

In [11]:
#Look at the types
things_df.dtypes

Name                  object
Position               int64
Time                 float64
Shoes                   bool
Join          datetime64[ns]
Race_Time    timedelta64[ns]
T_Shirt             category
dtype: object

### Back to our DataFrame

In [12]:
# Converting Age to Integer
df['Age'] = df['Age'].astype('int64')
df.dtypes

Name        object
Age          int64
Location    object
dtype: object

In [13]:
# Adding a column and assigning based on another column
# This time, since we adjsted the column to be a 64bit integer, math should work better.
df['Life_Stage'] = ['Old' if x > 25 else 'Young' for x in df['Age']]
df

     Name  Age       Location Life_Stage
1    Abby   21  United States      Young
4    Bert   34  United States        Old
2   Chris   19         Mexico      Young
3    Dean   52  United States        Old
0  Edward   12  United States      Young
5   Frank   46        Denmark        Old

In [14]:
# Looking at group by
# df.groupby(['Life_Stage']).median()  # old line errors out, we didn't specify what we wanted to median
df.groupby(['Life_Stage']).median('Age')

             Age
Life_Stage
Old         46.0
Young       19.0

In [15]:
# Another group by
# df.groupby(['Location']).median()  # old line errors out, we didn't specify what we wanted to median
df.groupby(['Location']).median('Age')

                Age
Location
Denmark        46.0
Mexico         19.0
United States  27.5

In [16]:
#Creating a new dataframe filtered from the first one
df2 = df[df['Location'] == 'United States']
df2

     Name  Age       Location Life_Stage
1    Abby   21  United States      Young
4    Bert   34  United States        Old
3    Dean   52  United States        Old
0  Edward   12  United States      Young

In [ ]:
# Exporting as a CSV
df2.to_csv('book1.csv', sep=',', index=False) ## CSV separated with a comma, ignoring the index

In [ ]:
##Write it to Excel
with pd.ExcelWriter('Demographics.xlsx',engine='openpyxl') as writer:
    df.to_excel(writer, sheet_name='All', index=False)
    df2.to_excel(writer, sheet_name='US Residents', index=False)

### Reshaping Data

In [17]:
# Wide data transformation
df = pd.DataFrame({
    'date' : ['05/03', '06/03', '07/03', '08/03'],
    'AA' : [1, 4, 7, 5],
    'BB' : [2, 5, 8, 7],
    'CC' : [3, 6, 9, 1]
}).set_index('date')
df

       AA  BB  CC
date
05/03   1   2   3
06/03   4   5   6
07/03   7   8   9
08/03   5   7   1

In [18]:
# Wide to long
# Melt to work, we can't use a date index so reset it
# Melt keeping your date and melting out the variables
df = df.reset_index()
wide_to_long = pd.melt(df, id_vars='date', value_vars=['AA', 'BB', 'CC'])
wide_to_long

     date variable  value
0   05/03       AA      1
1   06/03       AA      4
2   07/03       AA      7
3   08/03       AA      5
4   05/03       BB      2
5   06/03       BB      5
6   07/03       BB      8
7   08/03       BB      7
8   05/03       CC      3
9   06/03       CC      6
10  07/03       CC      9
11  08/03       CC      1

In [19]:
#Long to Wide
#How to accomplish a pivot with Pandas
long_to_wide = wide_to_long.pivot_table(index=['date'],columns='variable',values='value').reset_index()
long_to_wide

variable   date   AA   BB   CC
0         05/03  1.0  2.0  3.0
1         06/03  4.0  5.0  6.0
2         07/03  7.0  8.0  9.0
3         08/03  5.0  7.0  1.0

### Column Manipulation

In [20]:
#Working with data
df = pd.DataFrame({
    'Name' : ['Kristin Ruark','Leonila Maskell','Dena Streetman','Aleen Espinoza','Venetta Denison',
              'Paz Dowless','Lorette Landa','Lamonica Vogl','Keely Harbin','Lourdes Rathjen',
              'Lorilee Birge','Guillermo Borquez','Wayne Beggs','Corrie Kowalewski'],
    'Age' : [90,97,23,61,41,86,82,24,19,89,24,62,67,79],
    'Country' : ['Saint Pierre and Miquelon','Antarctica','Finland','Comoros','Anguilla','Italy',
                 'Virgin Islands (U.S.)','Liechtenstein','Liberia','Cook Islands','Albania',
                 'Maldives','Senegal','El Salvador'],
    'Hobby' : ['Candle making','Candy making','Car fixing & building','Card games','Cardistry',
               'Ceramics','Chatting','Cheesemaking','Chess','Cleaning','Clothesmaking',
               'Coffee roasting','Collecting','Coloring']
})
df

                 Name  Age                    Country                  Hobby
0       Kristin Ruark   90  Saint Pierre and Miquelon          Candle making
1     Leonila Maskell   97                 Antarctica           Candy making
2      Dena Streetman   23                    Finland  Car fixing & building
3      Aleen Espinoza   61                    Comoros             Card games
4     Venetta Denison   41                   Anguilla              Cardistry
5         Paz Dowless   86                      Italy               Ceramics
6       Lorette Landa   82      Virgin Islands (U.S.)               Chatting
7       Lamonica Vogl   24              Liechtenstein           Cheesemaking
8        Keely Harbin   19                    Liberia                  Chess
9     Lourdes Rathjen   89               Cook Islands               Cleaning
10      Lorilee Birge   24                    Albania          Clothesmaking
11  Guillermo Borquez   62                   Maldives        Coffee roasting
12        Wayne Beggs   67                    Senegal             Collecting
13  Corrie Kowalewski   79                El Salvador               Coloring

In [21]:
#Splitting Name into first and last
df[['Name','Last_Name']] = df['Name'].str.split(' ',expand=True)
df.rename(columns={'Name': 'First_Name'}, inplace=True)
df

,First_Name,Age,Country,Hobby,Last_Name
0,Kristin,90,Saint Pierre and Miquelon,Candle making,Ruark
1,Leonila,97,Antarctica,Candy making,Maskell
2,Dena,23,Finland,Car fixing & building,Streetman
3,Aleen,61,Comoros,Card games,Espinoza
4,Venetta,41,Anguilla,Cardistry,Denison
5,Paz,86,Italy,Ceramics,Dowless
6,Lorette,82,Virgin Islands (U.S.),Chatting,Landa
7,Lamonica,24,Liechtenstein,Cheesemaking,Vogl
8,Keely,19,Liberia,Chess,Harbin
9,Lourdes,89,Cook Islands,Cleaning,Rathjen
10,Lorilee,24,Albania,Clothesmaking,Birge
11,Guillermo,62,Maldives,Coffee roasting,Borquez
12,Wayne,67,Senegal,Collecting,Beggs
13,Corrie,79,El Salvador,Coloring,Kowalewski

In [22]:
#Reindexing
df = df.reindex(columns=['First_Name','Last_Name','Age','Hobby','Country'])
df

,First_Name,Last_Name,Age,Hobby,Country
0,Kristin,Ruark,90,Candle making,Saint Pierre and Miquelon
1,Leonila,Maskell,97,Candy making,Antarctica
2,Dena,Streetman,23,Car fixing & building,Finland
3,Aleen,Espinoza,61,Card games,Comoros
4,Venetta,Denison,41,Cardistry,Anguilla
5,Paz,Dowless,86,Ceramics,Italy
6,Lorette,Landa,82,Chatting,Virgin Islands (U.S.)
7,Lamonica,Vogl,24,Cheesemaking,Liechtenstein
8,Keely,Harbin,19,Chess,Liberia
9,Lourdes,Rathjen,89,Cleaning,Cook Islands
10,Lorilee,Birge,24,Clothesmaking,Albania
11,Guillermo,Borquez,62,Coffee roasting,Maldives
12,Wayne,Beggs,67,Collecting,Senegal
13,Corrie,Kowalewski,79,Coloring,El Salvador

In [ ]:
#Saving to Excel
df.to_excel("Output.xlsx",index=False,sheet_name='Roster')

### Merging DataFrames

In [23]:
#Merging Dataframes together
df1 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    index=[0, 1, 2, 3],
)


df2 = pd.DataFrame(
    {
        "A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"],
    },
    index=[4, 5, 6, 7],
)


df3 = pd.DataFrame(
    {
        "A": ["A8", "A9", "A10", "A11"],
        "B": ["B8", "B9", "B10", "B11"],
        "C": ["C8", "C9", "C10", "C11"],
        "D": ["D8", "D9", "D10", "D11"],
    },
    index=[8, 9, 10, 11],
)
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [24]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [25]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [26]:
#Merging operations
merged_list = [df1, df2, df3]
merged_df = pd.concat(merged_list)
merged_df

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## Putting concepts to work

In [27]:
#Importing from dataframes
# Data sourced from https://dataverse.harvard.edu/dataset.xhtml?persistentId=doi:10.7910/DVN/42MVDX&version=6.0
# Converted to an xlsx and tabbed by decade
# This could be from 1 spreadsheet, or other multiple sources
df1 = pd.read_excel("1976-2020-president.xlsx", "1970")
df2 = pd.read_excel("1976-2020-president.xlsx", "1980")
df3 = pd.read_excel("1976-2020-president.xlsx", "1990")
df4 = pd.read_excel("1976-2020-president.xlsx", "2000")
df4 = pd.read_excel("1976-2020-president.xlsx", "2010")
df5 = pd.read_excel("1976-2020-president.xlsx", "2020")

merged_list = [df1,df2,df3,df4,df5]
df = pd.concat(merged_list)
df

,year,state,state_po,state_fips,state_cen,state_ic,office,candidate,party_detailed,writein,candidatevotes,totalvotes,version,notes,party_simplified
0,1976,ALABAMA,AL,1,63,41,US PRESIDENT,"CARTER, JIMMY",DEMOCRAT,0.0,659170,1182850,20210113,NaN,DEMOCRAT
1,1976,ALABAMA,AL,1,63,41,US PRESIDENT,"FORD, GERALD",REPUBLICAN,0.0,504070,1182850,20210113,NaN,REPUBLICAN
2,1976,ALABAMA,AL,1,63,41,US PRESIDENT,"MADDOX, LESTER",AMERICAN INDEPENDENT PARTY,0.0,9198,1182850,20210113,NaN,OTHER
3,1976,ALABAMA,AL,1,63,41,US PRESIDENT,"BUBAR, BENJAMIN """"BEN""""",PROHIBITION,0.0,6669,1182850,20210113,NaN,OTHER
4,1976,ALABAMA,AL,1,63,41,US PRESIDENT,"HALL, GUS",COMMUNIST PARTY USE,0.0,1954,1182850,20210113,NaN,OTHER
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
542,2020,WYOMING,WY,56,83,68,US PRESIDENT,"JORGENSEN, JO",LIBERTARIAN,0.0,5768,278503,20210113,NaN,LIBERTARIAN
543,2020,WYOMING,WY,56,83,68,US PRESIDENT,"PIERCE, BROCK",INDEPENDENT,0.0,2208,278503,20210113,NaN,OTHER
544,2020,WYOMING,WY,56,83,68,US PRESIDENT,NaN,NaN,1.0,1739,278503,20210113,NaN,OTHER
545,2020,WYOMING,WY,56,83,68,US PRESIDENT,OVERVOTES,NaN,0.0,279,278503,20210113,NaN,OTHER
546,2020,WYOMING,WY,56,83,68,US PRESIDENT,UNDERVOTES,NaN,0.0,1459,278503,20210113,NaN,OTHER

In [28]:
#Start transformations
df.rename(columns={'state_po': 'state_acronym'}, inplace=True)
df.rename(columns={'candidatevotes': 'candidate_votes'}, inplace=True)
df.rename(columns={'totalvotes': 'total_votes'}, inplace=True)
df

,year,state,state_acronym,state_fips,state_cen,state_ic,office,candidate,party_detailed,writein,candidate_votes,total_votes,version,notes,party_simplified
0,1976,ALABAMA,AL,1,63,41,US PRESIDENT,"CARTER, JIMMY",DEMOCRAT,0.0,659170,1182850,20210113,NaN,DEMOCRAT
1,1976,ALABAMA,AL,1,63,41,US PRESIDENT,"FORD, GERALD",REPUBLICAN,0.0,504070,1182850,20210113,NaN,REPUBLICAN
2,1976,ALABAMA,AL,1,63,41,US PRESIDENT,"MADDOX, LESTER",AMERICAN INDEPENDENT PARTY,0.0,9198,1182850,20210113,NaN,OTHER
3,1976,ALABAMA,AL,1,63,41,US PRESIDENT,"BUBAR, BENJAMIN """"BEN""""",PROHIBITION,0.0,6669,1182850,20210113,NaN,OTHER
4,1976,ALABAMA,AL,1,63,41,US PRESIDENT,"HALL, GUS",COMMUNIST PARTY USE,0.0,1954,1182850,20210113,NaN,OTHER
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
542,2020,WYOMING,WY,56,83,68,US PRESIDENT,"JORGENSEN, JO",LIBERTARIAN,0.0,5768,278503,20210113,NaN,LIBERTARIAN
543,2020,WYOMING,WY,56,83,68,US PRESIDENT,"PIERCE, BROCK",INDEPENDENT,0.0,2208,278503,20210113,NaN,OTHER
544,2020,WYOMING,WY,56,83,68,US PRESIDENT,NaN,NaN,1.0,1739,278503,20210113,NaN,OTHER
545,2020,WYOMING,WY,56,83,68,US PRESIDENT,OVERVOTES,NaN,0.0,279,278503,20210113,NaN,OTHER
546,2020,WYOMING,WY,56,83,68,US PRESIDENT,UNDERVOTES,NaN,0.0,1459,278503,20210113,NaN,OTHER

In [30]:
# Create one report looking at total votes by state by year
report1_df = df.groupby(['year','state'],as_index=False).sum('candidate_votes')
report1_df = report1_df.drop(['state_fips', 'state_cen','total_votes','version','notes','state_ic'], axis = 1)
report1_df

     year          state  candidate_votes
0    1976        ALABAMA          1182850
1    1976         ALASKA           123574
2    1976        ARIZONA           742719
3    1976       ARKANSAS           767535
4    1976     CALIFORNIA          7803770
..    ...            ...              ...
454  2020       VIRGINIA          4460524
455  2020     WASHINGTON          4087631
456  2020  WEST VIRGINIA           794652
457  2020      WISCONSIN          3298041
458  2020        WYOMING           278503

[459 rows x 3 columns]

In [32]:
# Create one report looking at Votes by candidate by state
report2_df = df.groupby(['year','candidate'],as_index=False).sum('candidate_votes')
report2_df = report2_df.drop(['state_fips', 'state_cen','total_votes','version','notes','state_ic'], axis = 1)
report2_df

     year                candidate  candidate_votes
0    1976      ANDERSON, THOMAS J.           147835
1    1976  BUBAR, BENJAMIN ""BEN""            15888
2    1976            CAMEJO, PETER            89737
3    1976            CARTER, JIMMY         40825839
4    1976             FORD, GERALD         39145771
..    ...                      ...              ...
285  2020             WELLS, KASEY              212
286  2020              WEST, KANYE            70296
287  2020       WILLIAMS JR., ANDY                8
288  2020       WILLIAMS, MITCHELL                6
289  2020             YANG, ANDREW               58

[290 rows x 3 columns]

In [33]:
# Creating a pivot
report3_df = df.pivot_table(index='year',columns='candidate'
                            ,values='candidate_votes',aggfunc='sum').round(0)
report3_df = report3_df.fillna('0').astype(int) #Handling blanks and losing the trailing .0
report3_df

candidate,"ALEXANDER, STEWART","ANDERSON, JOHN B.","ANDERSON, ROSS CARL """"ROCKY""""","ANDERSON, THOMAS J.","ATWOOD, FRANK","BAKER, GERALD","BALDWIN, CHARLES """"CHUCK""""","BALL, DENNIS ANDREW","BARNETT, ANDRE","BARR, ROSEANNE",...,"WHITE, JEROME """"JERRY""""","WHITE, JERRY","WILLIAMS JR., ANDY","WILLIAMS, MITCHELL","WINN, EDWARD","WRIGHT, MARGARET","YANG, ANDREW","YIAMOUYIANNIS, JOHN","YOUNGKEIT, LOUIE G.","ZEIDLER, FRANK"
year,,,,,,,,,,,,,,,,,,,,,
1976,0,0,0,147835,0,0,0,0,0,0,...,0,0,0,0,0,46914,0,0,0,5632
1980,0,5719222,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1984,0,1479,0,0,0,892,0,0,0,0,...,0,0,0,0,14363,0,0,0,0,0
1988,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,22619,0,0,0,372,0
1992,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,808,0,0
1996,0,0,0,0,0,0,0,0,0,0,...,1901,0,0,0,0,0,0,0,0,0
2012,4074,0,28459,0,0,0,5017,0,820,67035,...,355,189,0,0,0,0,0,0,0,0
2016,0,0,0,0,337,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2020,0,0,0,0,0,0,0,11,0,0,...,0,0,8,6,0,0,58,0,0,0

In [ ]:
##Write it to Excel
with pd.ExcelWriter('Presidential_Candidates.xlsx',engine='openpyxl') as writer:
    report1_df.to_excel(writer, sheet_name='State Participation', index=False)
    report2_df.to_excel(writer, sheet_name='Candidate Votes', index=False)
    report3_df.to_excel(writer, sheet_name='Candidate Pivot', index=True)

Some further reading: <br>
Dataframes from alternate sources: https://pandas.pydata.org/docs/user_guide/io.html <br>
Merging dataframes: https://pandas.pydata.org/docs/user_guide/merging.html <br>
Melting and reshaping: https://pandas.pydata.org/docs/user_guide/reshaping.html <br>
Working with Nulls (NaN): https://pandas.pydata.org/docs/user_guide/missing_data.html <br>